air_drag = 0.07 #коэффициент пропорциональности между боковым ускорением и замедлением (для реальных ракет 1-5%)
eps = 1e-6  #число, приближенное к нулю
N = 3   #навигационная постоянная ракеты

plane_drag = True   #замедляется ли самолет
acceleration_n = 100    #предельное боковое ускорение самолета
acceleration_t = 10     #предельное продольное ускорение самолета
FPS = 600               #ограничение кадров
update_text_fps = 10    #частота обновления текста
scale = 7               #начальный масштаб симуляции
move_trajectory = 1     #сдвиг начала траектории самолета
win_zone_r = 5          #радиус области победы
plane_size = 2          #размер самолета (для поражения ракетой), при низком размере и fps ракета может проходить самолет насквозь

#НАЧАЛЬНЫЕ УСЛОВИЯ: x, y, vx, vy
airplane_start = [400.0, 400.0, -50.0, 0.0, air_drag if plane_drag else 0.0]
missile_start = [0.0, 0.0, 90.0, 0.0, air_drag]

airplane_max_speed = 50.0

def hypotenuse(a: float, b: float) -> float:
    return (a**2 + b**2)**0.5