air_drag = 0.07 #коэффициент пропорциональности между боковым ускорением ракеты и ее замедлением
eps = 1e-6  #число, приближенное к нулю
K_a = 10. # расстояние, на котором ускорение цели начинает учитывается в максимальном объеме

acceleration_pressed = 10   #ускорение самолета при нажатии клавиш
FPS = 60   #шагов симуляции в секунду (секунда симуляции, а не реальная)
sim_second = 1000 #длительность секунды симуляции в pygame, 1000 = 1 секунда

#НАЧАЛЬНЫЕ УСЛОВИЯ: x, y, vx, vy
airplane_start = [20.0, 20.0, -5., 0.0]
missile_start = [0.0, 0.0, 10.0, 0.0]