air_drag = 0.07 #коэффициент пропорциональности между боковым ускорением ракеты и ее замедлением (для реальных ракет 1-5%)
eps = 1e-6  #число, приближенное к нулю
N = 3   #навигационная постоянная ракеты

acceleration_pressed = 10   #ускорение самолета при нажатии клавиш
FPS = 120   #шагов симуляции в секунду (секунда симуляции, а не реальная)
sim_second = 1000 #длительность секунды симуляции в pygame, 1000 = 1 секунда
scale = 7 #масштаб симуляции
grid_size = 25  #размер сетки
alpha = 0.05 #коэффициент фильтрации ускорения
#НАЧАЛЬНЫЕ УСЛОВИЯ: x, y, vx, vy
airplane_start = [100.0, 100.0, -5., 0.0]
missile_start = [0.0, 0.0, 10.0, 0.0]